In [36]:
#吧图画到每个格里而不是弹出一个对话框
%matplotlib inline
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [39]:
df = pd.DataFrame({'Student_1':[90,100,95], 'Student_2':[60,80,100]}, index = ['Monday','Wednesday','Friday'])
df

           Student_1  Student_2
Monday            90         60
Wednesday        100         80
Friday            95        100

In [80]:
df1 = pd.DataFrame([[1,2,3],[4,5,6]], index = ['A','B'], columns=['C1','C2','C3'])
df1

   C1  C2  C3
A   1   2   3
B   4   5   6

In [43]:
df1.values

array([[1, 2, 3],
       [4, 5, 6]], dtype=int64)

In [45]:
df1.index

Index(['A', 'B'], dtype='object')

In [46]:
df1.columns

Index(['C1', 'C2', 'C3'], dtype='object')

In [47]:
df1.T

    A  B
C1  1  4
C2  2  5
C3  3  6

In [48]:
df1.shape

(2, 3)

In [49]:
df1.size

6

### Method

In [51]:
df1.head(1)

   C1  C2  C3
A   1   2   3

In [52]:
df1.tail(1) # 尾巴

   C1  C2  C3
B   4   5   6

In [54]:
df1.describe()

            C1       C2       C3
count  2.00000  2.00000  2.00000
mean   2.50000  3.50000  4.50000
std    2.12132  2.12132  2.12132
min    1.00000  2.00000  3.00000
25%    1.75000  2.75000  3.75000
50%    2.50000  3.50000  4.50000
75%    3.25000  4.25000  5.25000
max    4.00000  5.00000  6.00000

In [56]:
df1.loc['B']

C1    4
C2    5
C3    6
Name: B, dtype: int64

In [58]:
df1.loc['B'].loc['C2']

5

In [62]:
df1['C2'].loc['B']

5

In [63]:
df1.loc['B', 'C2']

5

In [59]:
df1.iloc[1,1]

5

In [65]:
df1 + 10 * 10

    C1   C2   C3
A  101  102  103
B  104  105  106

In [81]:
df1['C2'] = df1.apply(lambda x:x['C2'] ** 2 + 10, axis = 1)
df1

   C1  C2  C3
A   1  14   3
B   4  35   6